5. You have a dataset named customer_data.csv that contains information about customers. The dataset has columns customer_id, age, gender, email, and purchases. Write a Python script to read the dataset, perform data cleaning by removing duplicates and handling missing values, and then calculate the average number of purchases for each gender.

In [35]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [36]:
df = pd.read_csv("D:\Data Analytics - Pre Screening Test\customer_data.csv")

In [37]:
df

   customer_id  age gender            email  purchases
0         1001   35      M  abc@example.com       10.0
1         1002   28      F  def@example.com        5.0
2         1003   40      F  ghi@example.com        NaN
3         1004   45      M  jkl@example.com        8.0
4         1005   33      M  mno@example.com       15.0
5         1006   27      F  pqr@example.com        NaN
6         1007   50      M  stu@example.com       12.0
7         1008   29      F  vwx@example.com        7.0
8         1009   38      F  yza@example.com        9.0

In [38]:
#Handling Duplicates Value Threre is no duplicates

In [39]:
df.duplicated().sum()

0

In [40]:
#Handling Null Value There are 2 nulls in purchase

In [41]:
df.isna().sum()

customer_id    0
age            0
gender         0
email          0
purchases      2
dtype: int64

In [42]:
#Either we can remove or replace null by mean or median

In [45]:
df['purchases'] = df['purchases'].fillna(df['purchases'].median())

In [46]:
 df.isnull().sum()

customer_id    0
age            0
gender         0
email          0
purchases      0
dtype: int64

In [47]:
df.groupby('gender')['purchases'].sum()

gender
F    39.0
M    45.0
Name: purchases, dtype: float64

In [55]:
d = df.groupby('gender')['purchases'].mean().reset_index()

In [58]:
d.rename(columns={'purchases':'avg_purchases'})

  gender  avg_purchases
0      F           7.80
1      M          11.25